esp8266/Arduino/boards.txt
##############################################################
espresso_lite_v1.name=ESPresso Lite 1.0
espresso_lite_v1.upload.tool=esptool
espresso_lite_v1.upload.speed=115200
espresso_lite_v1.upload.maximum_size=1044464
espresso_lite_v1.upload.maximum_data_size=81920
espresso_lite_v1.upload.wait_for_upload_port=true

espresso_lite_v1.build.mcu=esp8266
espresso_lite_v1.build.f_cpu=80000000L
espresso_lite_v1.build.board=ESP8266_ESPRESSO_LITE_V1
espresso_lite_v1.build.core=esp8266
espresso_lite_v1.build.variant=espresso_lite_v1
espresso_lite_v1.build.flash_mode=dio
espresso_lite_v1.build.flash_size=4M
espresso_lite_v1.build.flash_freq=40

espresso_lite_v1.menu.CpuFrequency.80=80 MHz
espresso_lite_v1.menu.CpuFrequency.80.build.f_cpu=80000000L
espresso_lite_v1.menu.CpuFrequency.160=160 MHz
espresso_lite_v1.menu.CpuFrequency.160.build.f_cpu=160000000L

espresso_lite_v1.menu.UploadSpeed.115200=115200
espresso_lite_v1.menu.UploadSpeed.115200.upload.speed=115200
espresso_lite_v1.menu.UploadSpeed.57600=57600
espresso_lite_v1.menu.UploadSpeed.57600.upload.speed=57600
espresso_lite_v1.menu.UploadSpeed.256000.windows=256000
espresso_lite_v1.menu.UploadSpeed.256000.upload.speed=256000
espresso_lite_v1.menu.UploadSpeed.230400.linux=230400
espresso_lite_v1.menu.UploadSpeed.230400.macosx=230400
espresso_lite_v1.menu.UploadSpeed.230400.macosx=230400
espresso_lite_v1.menu.UploadSpeed.230400.upload.speed=230400
espresso_lite_v1.menu.UploadSpeed.460800.linux=460800
espresso_lite_v1.menu.UploadSpeed.460800.macosx=460800
espresso_lite_v1.menu.UploadSpeed.460800.upload.speed=460800
espresso_lite_v1.menu.UploadSpeed.512000.windows=512000
espresso_lite_v1.menu.UploadSpeed.512000.upload.speed=512000
espresso_lite_v1.menu.UploadSpeed.921600=921600
espresso_lite_v1.menu.UploadSpeed.921600.upload.speed=921600

espresso_lite_v1.menu.FlashSize.4M3M=4M (3M SPIFFS)
espresso_lite_v1.menu.FlashSize.4M3M.build.flash_size=4M
espresso_lite_v1.menu.FlashSize.4M3M.build.flash_ld=eagle.flash.4m.ld
espresso_lite_v1.menu.FlashSize.4M3M.build.spiffs_start=0x100000
espresso_lite_v1.menu.FlashSize.4M3M.build.spiffs_end=0x3FB000
espresso_lite_v1.menu.FlashSize.4M3M.build.spiffs_blocksize=8192
espresso_lite_v1.menu.FlashSize.4M3M.upload.maximum_size=1044464

espresso_lite_v1.menu.FlashSize.4M1M=4M (1M SPIFFS)
espresso_lite_v1.menu.FlashSize.4M1M.build.flash_size=4M
espresso_lite_v1.menu.FlashSize.4M1M.build.flash_ld=eagle.flash.4m1m.ld
espresso_lite_v1.menu.FlashSize.4M1M.build.spiffs_start=0x300000
espresso_lite_v1.menu.FlashSize.4M1M.build.spiffs_end=0x3FB000
espresso_lite_v1.menu.FlashSize.4M1M.build.spiffs_blocksize=8192
espresso_lite_v1.menu.FlashSize.4M1M.build.spiffs_pagesize=256
espresso_lite_v1.menu.FlashSize.4M1M.upload.maximum_size=1044464

espresso_lite_v1.menu.ResetMethod.nodemcu=nodemcu
espresso_lite_v1.menu.ResetMethod.nodemcu.upload.resetmethod=nodemcu
espresso_lite_v1.menu.ResetMethod.ck=ck
espresso_lite_v1.menu.ResetMethod.ck.upload.resetmethod=ck

espresso_lite_v1.menu.Debug.Disabled=Disabled
espresso_lite_v1.menu.Debug.Disabled.build.debug_port=
espresso_lite_v1.menu.Debug.Serial=Serial
espresso_lite_v1.menu.Debug.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
espresso_lite_v1.menu.Debug.Serial1=Serial1
espresso_lite_v1.menu.Debug.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1

espresso_lite_v1.menu.DebugLevel.None____=None
espresso_lite_v1.menu.DebugLevel.None____.build.debug_level=
espresso_lite_v1.menu.DebugLevel.Core____=Core
espresso_lite_v1.menu.DebugLevel.Core____.build.debug_level=-DDEBUG_ESP_CORE
espresso_lite_v1.menu.DebugLevel.SSL_____=Core + SSL
espresso_lite_v1.menu.DebugLevel.SSL_____.build.debug_level=-DDEBUG_ESP_CORE -DDEBUG_ESP_SSL
espresso_lite_v1.menu.DebugLevel.SSL_MEM_=Core + SSL + TLS Mem
espresso_lite_v1.menu.DebugLevel.SSL_MEM_.build.debug_level=-DDEBUG_ESP_CORE -DDEBUG_ESP_SSL -DDEBUG_TLS_MEM
espresso_lite_v1.menu.DebugLevel.WiFic___=Core + WiFi
espresso_lite_v1.menu.DebugLevel.WiFic___.build.debug_level=-DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI
espresso_lite_v1.menu.DebugLevel.WiFi____=WiFi
espresso_lite_v1.menu.DebugLevel.WiFi____.build.debug_level=-DDEBUG_ESP_WIFI
espresso_lite_v1.menu.DebugLevel.HTTPClient=HTTPClient
espresso_lite_v1.menu.DebugLevel.HTTPClient.build.debug_level=-DDEBUG_ESP_HTTP_CLIENT
espresso_lite_v1.menu.DebugLevel.HTTPClient2=HTTPClient + SSL
espresso_lite_v1.menu.DebugLevel.HTTPClient2.build.debug_level=-DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_SSL
espresso_lite_v1.menu.DebugLevel.HTTPUpdate=HTTPUpdate
espresso_lite_v1.menu.DebugLevel.HTTPUpdate.build.debug_level=-DDEBUG_ESP_HTTP_UPDATE
espresso_lite_v1.menu.DebugLevel.HTTPUpdate2=HTTPClient + HTTPUpdate
espresso_lite_v1.menu.DebugLevel.HTTPUpdate2.build.debug_level=-DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_HTTP_UPDATE
espresso_lite_v1.menu.DebugLevel.HTTPUpdate3=HTTPClient + HTTPUpdate + Updater
espresso_lite_v1.menu.DebugLevel.HTTPUpdate3.build.debug_level=-DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER
espresso_lite_v1.menu.DebugLevel.HTTPServer=HTTPServer
espresso_lite_v1.menu.DebugLevel.HTTPServer.build.debug_level=-DDEBUG_ESP_HTTP_SERVER
espresso_lite_v1.menu.DebugLevel.UPDATER=Updater
espresso_lite_v1.menu.DebugLevel.UPDATER.build.debug_level=-DDEBUG_ESP_UPDATER
espresso_lite_v1.menu.DebugLevel.OTA_____=OTA
espresso_lite_v1.menu.DebugLevel.OTA_____.build.debug_level=-DDEBUG_ESP_OTA
espresso_lite_v1.menu.DebugLevel.OTA2____=OTA + Updater
espresso_lite_v1.menu.DebugLevel.OTA2____.build.debug_level=-DDEBUG_ESP_OTA -DDEBUG_ESP_UPDATER
espresso_lite_v1.menu.DebugLevel.all_____=All
espresso_lite_v1.menu.DebugLevel.all_____.build.debug_level=-DDEBUG_ESP_CORE -DDEBUG_ESP_SSL -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_TLS_MEM

espresso_lite_v1.build.debug_port=
espresso_lite_v1.build.debug_level=

##############################################################
espresso_lite_v2.name=ESPresso Lite 2.0
espresso_lite_v2.upload.tool=esptool
espresso_lite_v2.upload.speed=115200
espresso_lite_v2.upload.maximum_size=1044464
espresso_lite_v2.upload.maximum_data_size=81920
espresso_lite_v2.upload.wait_for_upload_port=true

espresso_lite_v2.build.mcu=esp8266
espresso_lite_v2.build.f_cpu=80000000L
espresso_lite_v2.build.board=ESP8266_ESPRESSO_LITE_V2
espresso_lite_v2.build.core=esp8266
espresso_lite_v2.build.variant=espresso_lite_v2
espresso_lite_v2.build.flash_mode=dio
espresso_lite_v2.build.flash_size=4M
espresso_lite_v2.build.flash_freq=40

espresso_lite_v2.menu.CpuFrequency.80=80 MHz
espresso_lite_v2.menu.CpuFrequency.80.build.f_cpu=80000000L
espresso_lite_v2.menu.CpuFrequency.160=160 MHz
espresso_lite_v2.menu.CpuFrequency.160.build.f_cpu=160000000L

espresso_lite_v2.menu.UploadSpeed.115200=115200
espresso_lite_v2.menu.UploadSpeed.115200.upload.speed=115200
espresso_lite_v2.menu.UploadSpeed.57600=57600
espresso_lite_v2.menu.UploadSpeed.57600.upload.speed=57600
espresso_lite_v2.menu.UploadSpeed.256000.windows=256000
espresso_lite_v2.menu.UploadSpeed.256000.upload.speed=256000
espresso_lite_v2.menu.UploadSpeed.230400.linux=230400
espresso_lite_v2.menu.UploadSpeed.230400.macosx=230400
espresso_lite_v2.menu.UploadSpeed.230400.macosx=230400
espresso_lite_v2.menu.UploadSpeed.230400.upload.speed=230400
espresso_lite_v2.menu.UploadSpeed.460800.linux=460800
espresso_lite_v2.menu.UploadSpeed.460800.macosx=460800
espresso_lite_v2.menu.UploadSpeed.460800.upload.speed=460800
espresso_lite_v2.menu.UploadSpeed.512000.windows=512000
espresso_lite_v2.menu.UploadSpeed.512000.upload.speed=512000
espresso_lite_v2.menu.UploadSpeed.921600=921600
espresso_lite_v2.menu.UploadSpeed.921600.upload.speed=921600

