esp8266/Arduino/boards.txt
##############################################################
yison.name=YISON ESP-01/ESP-202

yison.upload.tool=esptool
yison.upload.speed=9216000
yison.upload.resetmethod=ck
yison.upload.maximum_size=1044464
yison.upload.maximum_data_size=81920
yison.upload.wait_for_upload_port=true
yison.serial.disableDTR=true
yison.serial.disableRTS=true

yison.build.mcu=esp8266
yison.build.f_cpu=80000000L
yison.build.board=ESP8266_YISON
yison.build.core=esp8266
yison.build.variant=yison
yison.build.flash_mode=qio
yison.build.flash_size=4M
yison.build.flash_freq=80
yison.build.spiffs_pagesize=256
yison.build.debug_port=
yison.build.debug_level=

yison.menu.CpuFrequency.80=80 MHz
yison.menu.CpuFrequency.80.build.f_cpu=80000000L
yison.menu.CpuFrequency.160=160 MHz
yison.menu.CpuFrequency.160.build.f_cpu=160000000L

yison.menu.UploadSpeed.115200=115200
yison.menu.UploadSpeed.115200.upload.speed=115200
yison.menu.UploadSpeed.9600=9600
yison.menu.UploadSpeed.9600.upload.speed=9600
yison.menu.UploadSpeed.57600=57600
yison.menu.UploadSpeed.57600.upload.speed=57600
yison.menu.UploadSpeed.256000.windows=256000
yison.menu.UploadSpeed.256000.upload.speed=256000
yison.menu.UploadSpeed.230400.linux=230400
yison.menu.UploadSpeed.230400.macosx=230400
yison.menu.UploadSpeed.230400.upload.speed=230400
yison.menu.UploadSpeed.460800.linux=460800
yison.menu.UploadSpeed.460800.macosx=460800
yison.menu.UploadSpeed.460800.upload.speed=460800
yison.menu.UploadSpeed.512000.windows=512000
yison.menu.UploadSpeed.512000.upload.speed=512000
yison.menu.UploadSpeed.921600=921600
yison.menu.UploadSpeed.921600.upload.speed=921600

yison.menu.FlashSize.4M3M=4M (3M SPIFFS)
yison.menu.FlashSize.4M3M.build.flash_size=4M
yison.menu.FlashSize.4M3M.build.flash_ld=eagle.flash.4m.ld
yison.menu.FlashSize.4M3M.build.spiffs_start=0x100000
yison.menu.FlashSize.4M3M.build.spiffs_end=0x3FB000
yison.menu.FlashSize.4M3M.build.spiffs_blocksize=8192
yison.menu.FlashSize.4M3M.build.spiffs_pagesize=256

yison.menu.FlashSize.4M1M=4M (1M SPIFFS)
yison.menu.FlashSize.4M1M.build.flash_size=4M
yison.menu.FlashSize.4M1M.build.flash_ld=eagle.flash.4m1m.ld
yison.menu.FlashSize.4M1M.build.spiffs_start=0x300000
yison.menu.FlashSize.4M1M.build.spiffs_end=0x3FB000
yison.menu.FlashSize.4M1M.build.spiffs_blocksize=8192
yison.menu.FlashSize.4M1M.build.spiffs_pagesize=256

yison.menu.ResetMethod.ck=ck
yison.menu.ResetMethod.ck.upload.resetmethod=ck
yison.menu.ResetMethod.nodemcu=nodemcu
yison.menu.ResetMethod.nodemcu.upload.resetmethod=nodemcu

yison.menu.Debug.Disabled=Disabled
yison.menu.Debug.Disabled.build.debug_port=
yison.menu.Debug.Serial=Serial
yison.menu.Debug.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
yison.menu.Debug.Serial1=Serial1
yison.menu.Debug.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1

yison.menu.DebugLevel.None____=None
yison.menu.DebugLevel.None____.build.debug_level=
yison.menu.DebugLevel.Core____=Core
yison.menu.DebugLevel.Core____.build.debug_level=-DDEBUG_ESP_CORE
yison.menu.DebugLevel.SSL_____=Core + SSL
yison.menu.DebugLevel.SSL_____.build.debug_level=-DDEBUG_ESP_CORE -DDEBUG_ESP_SSL
yison.menu.DebugLevel.SSL_MEM_=Core + SSL + TLS Mem
yison.menu.DebugLevel.SSL_MEM_.build.debug_level=-DDEBUG_ESP_CORE -DDEBUG_ESP_SSL -DDEBUG_TLS_MEM
yison.menu.DebugLevel.WiFic___=Core + WiFi
yison.menu.DebugLevel.WiFic___.build.debug_level=-DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI
yison.menu.DebugLevel.WiFi____=WiFi
yison.menu.DebugLevel.WiFi____.build.debug_level=-DDEBUG_ESP_WIFI
yison.menu.DebugLevel.HTTPClient=HTTPClient
yison.menu.DebugLevel.HTTPClient.build.debug_level=-DDEBUG_ESP_HTTP_CLIENT
yison.menu.DebugLevel.HTTPClient2=HTTPClient + SSL
yison.menu.DebugLevel.HTTPClient2.build.debug_level=-DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_SSL
yison.menu.DebugLevel.HTTPUpdate=HTTPUpdate
yison.menu.DebugLevel.HTTPUpdate.build.debug_level=-DDEBUG_ESP_HTTP_UPDATE
yison.menu.DebugLevel.HTTPUpdate2=HTTPClient + HTTPUpdate
yison.menu.DebugLevel.HTTPUpdate2.build.debug_level=-DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_HTTP_UPDATE
yison.menu.DebugLevel.HTTPUpdate3=HTTPClient + HTTPUpdate + Updater
yison.menu.DebugLevel.HTTPUpdate3.build.debug_level=-DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER
yison.menu.DebugLevel.HTTPServer=HTTPServer
yison.menu.DebugLevel.HTTPServer.build.debug_level=-DDEBUG_ESP_HTTP_SERVER
yison.menu.DebugLevel.UPDATER=Updater
yison.menu.DebugLevel.UPDATER.build.debug_level=-DDEBUG_ESP_UPDATER
yison.menu.DebugLevel.OTA_____=OTA
yison.menu.DebugLevel.OTA_____.build.debug_level=-DDEBUG_ESP_OTA
yison.menu.DebugLevel.OTA2____=OTA + Updater
yison.menu.DebugLevel.OTA2____.build.debug_level=-DDEBUG_ESP_OTA -DDEBUG_ESP_UPDATER
yison.menu.DebugLevel.all_____=All
yison.menu.DebugLevel.all_____.build.debug_level=-DDEBUG_ESP_CORE -DDEBUG_ESP_SSL -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_TLS_MEM
